CREATE DATABASE tickets;

USE tickets;

CREATE TABLE `users` (
    `id` int NOT NULL,
    `name` varchar(100) NOT NULL,
    `email` varchar(100) NOT NULL,
    `phone` varchar(100) NOT NULL,
    `city` varchar(100) NOT NULL,
    `password` varchar(12) NOT NULL DEFAULT '1111'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

ALTER TABLE `users`
    MODIFY id int NOT NULL PRIMARY KEY AUTO_INCREMENT,
    ADD KEY `name` (`name`),
    ADD KEY `email` (`email`),
    ADD KEY `phone` (`phone`),
    ADD KEY `city` (`city`),
    ADD KEY `password` (`password`);

##################################################

CREATE TABLE IF NOT EXISTS `crud` (
    `id` int NOT NULL,
    `name` varchar(255) NOT NULL,
    `email` varchar(255) NOT NULL,
    `phone` varchar(255) NOT NULL,
    `city` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=UTF8MB4;

ALTER TABLE `crud`
    MODIFY id int NOT NULL PRIMARY KEY AUTO_INCREMENT,
    ADD KEY `name` (`name`),
    ADD KEY `email` (`email`),
    ADD KEY `phone` (`phone`),
    ADD KEY `city` (`city`);

INSERT INTO `crud` (`name`, `email`, `phone`, `city`) VALUES
    ('Надвірна', 'АТП 126129', 'АТ001АА',  'Назавизів'),
    ('Надвірна', 'АТП 126129', 'АТ001АА',  'Тарновиця'),
    ('Надвірна', 'АТП 126129', 'АТ001АА',  'Цуцилів'),
    ('Надвірна', 'АТП 126129', 'АТ001АА',  'Тисменитчани'),
    ('Надвірна', 'АТП 126129', 'АТ001АА',  'Назавизів'),
    ('Надвірна', 'АТП 126129', 'АТ002АА',  'Тарновиця'),
    ('Надвірна', 'АТП 126129', 'АТ003АА',  'Перерісель'),
    ('Надвірна', 'АТП 126129', 'АТ004АА',  'Цуцилів'),
    ('Надвірна', 'АТП 126129', 'АТ005АА',  'Тисменитчани'),
    ('Надвірна', 'АТП 126129', 'АТ006АА',  'Березівка'),
    ('Надвірна', 'АТП 126129', 'АТ007АА',  'Івано-Франківськ'),
    ('Надвірна', 'Баран В.В.', 'АТ008АА',  'Назавизів'),
    ('Надвірна', 'Баран В.В.', 'АТ009АА',  'Тарновиця'),
    ('Надвірна', 'Баран В.В.', 'АТ010АА',  'Перерісель'),
    ('Надвірна', 'Баран В.В.', 'АТ011АА',  'Цуцилів'),
    ('Надвірна', 'Баран В.В.', 'АТ012АА',  'Тисменитчани'),
    ('Надвірна', 'Баран В.В.', 'АТ013АА',  'Березівка'),
    ('Надвірна', 'Баран В.В.', 'АТ014АА',  'Івано-Франківськ'),
    ('Надвірна', 'Гранд транс компані', 'АТ015АА',  'Назавизів'),
    ('Надвірна', 'Гранд транс компані', 'АТ016АА',  'Тарновиця'),
    ('Надвірна', 'Гранд транс компані', 'АТ017АА',  'Перерісель'),
    ('Надвірна', 'Гранд транс компані', 'АТ018АА',  'Цуцилів'),
    ('Надвірна', 'Гранд транс компані', 'АТ019АА',  'Тисменитчани'),
    ('Надвірна', 'Гранд транс компані', 'АТ020АА',  'Березівка'),
    ('Надвірна', 'Гранд транс компані', 'АТ021АА',  'Івано-Франківськ');

##################################################